<a href="https://colab.research.google.com/github/MaximNetolog/index.html-/blob/main/untitled.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [ ]:
df_city = pd.read_sql(
"""select
 * 
 from city;
 """,
 'postgresql://netology:NetoSQL2019@84.201.153.170:19001/world-db')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [ ]:
df_city

        id            name country_code       district  population
0        1           Kabul          AFG          Kabol     1780000
1        2        Qandahar          AFG       Qandahar      237500
2        3           Herat          AFG          Herat      186800
3        4  Mazar-e-Sharif          AFG          Balkh      127800
4        5       Amsterdam          NLD  Noord-Holland      731200
...    ...             ...          ...            ...         ...
4074  4075      Khan Yunis          PSE     Khan Yunis      123175
4075  4076          Hebron          PSE         Hebron      119401
4076  4077        Jabaliya          PSE     North Gaza      113901
4077  4078          Nablus          PSE         Nablus      100231
4078  4079           Rafah          PSE          Rafah       92020

[4079 rows x 5 columns]

In [ ]:
df_ct=pd.read_csv('City.csv',sep=';')

In [ ]:
df_ct

                     Страна  ... название города по-английски
0                     Китай  ...                        Sanya
1                Черногория  ...                        Budva
2                    Турция  ...                         Side
3  Доминиканская республика  ...                       Higuei
4                    Россия  ...                        Sochi
5                   Вьетнам  ...                    Nha Trang
6                    Россия  ...                        Sochi
7                   Тайланд  ...                      Chalong
8                   Абхазия  ...                       Sukhum
9                    Россия  ...                        Yalta

[10 rows x 11 columns]

In [ ]:
df_pop=pd.read_sql(
    """
    select
      name,
      population
    from
      city
    """,
"postgresql://netology:NetoSQL2019@84.201.153.170:19001/world-db"
)

In [ ]:
df_pop

                name  population
0              Kabul     1780000
1           Qandahar      237500
2              Herat      186800
3     Mazar-e-Sharif      127800
4          Amsterdam      731200
...              ...         ...
4074      Khan Yunis      123175
4075          Hebron      119401
4076        Jabaliya      113901
4077          Nablus      100231
4078           Rafah       92020

[4079 rows x 2 columns]

In [ ]:
df_final=pd.merge(
    df_ct,
    df_pop,
      left_on='название города по-английски',
      right_on='name'

)

In [ ]:
df_final

    Страна   Город  ...       name  population
0    Китай   Санья  ...      Sanya      102820
1  Вьетнам  Нячанг  ...  Nha Trang      221331

[2 rows x 13 columns]

In [ ]:
#расчет среднего значения.
df_mean=df_final[['population']]
df_mean_final=df_mean.mean
df_mean

   population
0      102820
1      221331